---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterStringBeginsWith
source: html/4c21204c-4fa2-6945-caf9-4af7807a6e07.htm
---
# FilterStringBeginsWith Methods

Derived classes override this method to implement the test that determines
 whether the two given string values satisfy the desired condition or not.